app/controllers/sales_controller.rb

		def create
  			@sale = Sale.new(sale_params)

  			if @sale.save
---
INSERT INTO "sales" ("address", "created_at", "customer", "item", "quantity", "salesperson", "updated_at", "value") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

		def show

			@sale = Sale.find(params[:id])
---
SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", "1"]]

		def edit
			@sale = Sale.find(params[:id])
---
SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", "8"]]

		def update
			@sale = Sale.find(params[:id])

			if @sale.update(sale_params)
---
SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "sales" SET "customer" = ?, "salesperson" = ?, "updated_at" = ? WHERE "sales"."id" = 3  [["customer", "Myself"], ["salesperson", "Myself"], ["updated_at", Thu, 03 Jul 2014 12:19:28 UTC +00:00]]

		def destroy
			@sale = Sale.find(params[:id])
			@sale.destroy
---
SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", "8"]]
DELETE FROM "sales" WHERE "sales"."id" = ?  [["id", 8]]